<script setup>

</script>

<template>
  <div class="container my-5">
    <div class="row row-cols-1 row-cols-md-3 g-4">
  <div class="col">
    <div class="card">
      <img src="https://i.pinimg.com/564x/68/7f/22/687f22148167ffd4c3fa25f812a04010.jpg" class="card-img-top" alt="...">
      <div class="card-body">
        <h5 class="card-title">Lisa </h5>
        <p class="card-text">
ลิซ่า มีชื่อจริงว่า ลลิษา มโนบาล
ชื่อเดิมคือ ปราณปรียา มโนบาล
ชื่อเล่น ลิซ่า, ลลิซ
ชื่อเล่นเดิม ป๊อกแป๊ก
เกิดวันที่ 27 มีนาคม พ.ศ. 2540
ภูมิลำเนา เป็นคนจังหวัดบุรีรัมย์
จบการศึกษาระดับมัธยมศึกษาจากโรงเรียนประภามนตรี 1 และ 2
IG : lalalalisa_m</p>
      </div>
    </div>
  </div>
  <div class="col">
    <div class="card">
      <img src="https://i.pinimg.com/564x/49/5e/04/495e044f254ef22c38884adef514b8c6.jpg" class="card-img-top" height="550" alt="...">
      <div class="card-body">
        <h5 class="card-title">Jennie</h5>
        <p class="card-text"> เจนนี่ ชื่อจริงคือ คิมเจนนี่  เกิดเมื่อวันที่ 16 มกราคม 1996 ที่กรุงโซล ประเทศเกาหลีใต้ ต่อมาได้ย้ายไปศึกษาต่อที่นิวซีแลนด์ ในฐานะนักเรียนแลกเปลี่ยนเป็นเวลา 5 ปี ที่วิทยาลัยเอซีจีพาร์เนลล์ (ACG Parnell College) ก่อนย้ายกลับมายังเกาหลีใต้ เพื่อทำตามความฝันที่อยากจะเป็นนักร้อง
</p>
      </div>
    </div>
  </div>
  <div class="col">
    <div class="card">
      <img src="https://i.pinimg.com/564x/a7/5c/f8/a75cf8231a1c9481c9ae76d5acd9d5a5.jpg" class="card-img-top" height="550" alt="...">
      <div class="card-body">
        <h5 class="card-title">jisoo</h5>
        <p class="card-text">  จีซู  หรือ คิมจีซู  เกิดเมื่อวันที่ 3 มกราคม 1995 ในจังหวัดคยองกี ประเทศเกาหลีใต้ เป็นลูกสาวคนสุดท้องในจำนวนพี่น้อง 3 คน โดยมีพี่สาว 1 คน ชื่อ คิมจียุน และมีพี่ชายอีก 1 คน ชื่อ คิมจองฮุน
          จีซู จบการศึกษาระดับมัธยมศึกษาตอนต้นที่โรงเรียนมัธยมควาชอนชุงอัง ในจังหวัดคยองกี และย้ายไปศึกษาต่อในระดับมัธยมศึกษาตอนปลายที่โรงเรียนศิลปะการแสดงแห่งกรุงโซล </p>
      </div>
    </div>
  </div>
  <div class="col">
    <div class="card">
      <img src="https://i.pinimg.com/564x/e2/2c/3b/e22c3bfe5e47a4afd79165ee7b486d90.jpg" class="card-img-top"  alt="...">
      <div class="card-body">
        <h5 class="card-title">Rosé</h5>
        <p class="card-text"> โรเซ่ ชื่อจริงคือ Roseanne Park หรือชื่อภาษาเกาหลี คือ พัคแชยอง  เกิดวันที่ 11 กุมภาพันธ์ 1997 มีพี่สาว 1 คน คือ อลิซ พัค เป็นชาวเกาหลีใต้ แต่เกิดที่เมืองออกแลนด์ ประเทศนิวซีแลนด์ เธอใช้ชีวิตที่นั่นจนอายุประมาณ 7-8 ขวบ ก่อนจะย้ายไปเติบโตในเมืองเมลเบิร์น ประเทศออสเตรเลีย และได้เข้าเรียนระดับมัธยมศึกษาที่วิทยาลัยแคนเทอร์เกิร์ล  และในช่วงเวลานั้นเธอยังเป็นนักร้องประสานเสียงที่โบสถ์ในออสเตรเลียด้วย แต่เธอก็ดรอปการเรียนไว้ในเกรด 11 หลังจากเซ็นสัญญากับค่ายเพลงยักษ์ใหญ่ของเกาหลีใต้อย่าง YG Entertainment นอกจากนี้แล้ว โรเซ่ ยังมีความสามารถพิเศษในการเล่นดนตรีอย่างกีตาร์และเปียโนอีกด้วย</p>
      </div>
    </div>
  </div>
</div>
  </div>
</template>
