<script setup>
import { toast } from 'vue3-toastify';
import 'vue3-toastify/dist/index.css';

toast.info("Welcome to black pink in your area", {
  autoClose: 1500,
  position:toast.POSITION.TOP_CENTER
})

const notify = () => {
  toast.success("ยินดีต้อนรับสู่ Blackpink in Your Area ", {
    autoClose: 1500,
    position: toast.POSITION.TOP_CENTER
  })
  return notify
}

</script>

<template>
  <div class="container my-5">
    <div class="card-group">
  <div class="card">
    <img src="https://i.pinimg.com/564x/66/59/b1/6659b101c231008560e86c9df2e239b3.jpg" class="card-img-top" height="260px" alt="...">
    <div class="card-body">
      <h5 class="card-title">Black Pink</h5>
      <p class="card-text">แบล็กพิงก์ (เกาหลี: 블랙핑크; อาร์อาร์: Beullaekpingkeu; อังกฤษ: Blackpink, มักเขียน BLACKPINK หรือ BLɅϽKPIИK) เป็นเกิร์ลกรุปเกาหลีใต้ สังกัดวายจีเอนเตอร์เทนเมนต์ ประกอบด้วยสมาชิกจำนวนสี่คนคือ จีซู, เจนนี, โรเซ และ​ลิซ่า ได้รับการขนานนามว่าเป็น "เกิร์ลกรุปที่ยิ่งใหญ่ที่สุดในโลก" พวกเธอถือเป็นเกิร์ลกรุปเกาหลีที่ประสบความสำเร็จระดับนานาชาติมากที่สุดและเป็นหนึ่งในผู้นำกระแสเกาหลี โดยมีรูปแบบเกี่ยวกับแนวคิด "เกิร์ลครัช" ในเคป็อป—การสำรวจธีมความมั่นใจในตนเองและพลังของผู้หญิง</p>
      <p class="card-text"><small class="text-body-secondary">Last updated 3 mins ago</small></p>
    </div>
  </div>
  <div class="card">
    <img src="https://i.pinimg.com/564x/50/27/fc/5027fcde6d1d613938ef3b80f1a27f65.jpg" class="card-img-top" height="260px" alt="...">
    <div class="card-body">
      <h5 class="card-title">Black Pink</h5>
      <p class="card-text">แบล็กพิงก์เปิดตัวในเดือนสิงหาคม 2016 พร้อมกับซิงเกิลอัลบั้ม สแควร์วัน นำเสนอเพลงอย่าง "วิสเซิล" และ "บูมบายาห์" ที่สามารถขึ้นอันดับหนึ่งบนแกออนดิจิทัลชาร์ตของเกาหลีใต้ และบิลบอร์ด เวิลด์ดิจิทัลซองส์ ตามลำดับ ต่อมาออกซิงเกิลอัลบั้ม สแควร์ทู ในเดือนพฤศจิกายน ซึ่งเพลง "เพลย์อิงวิทไฟร์" กลายเป็นเพลงแรกของเกิร์ลกรุปเกาหลีที่ติดชาร์ตแคนาเดียนฮอต 100 วงเริ่มมีชื่อเสียงระดับนานาชาติ หลังจากออกซิงเกิล "ตู-ดู ตู-ดู" (2018) ซึ่งเป็นเพลงแรกของศิลปินกลุ่มหญิงเกาหลีที่ติดชาร์ตซิงเกิลแห่งสหราชอาณาจักรและได้รับการรับรองในสหรัฐ มิวสิกวิดีโอนี้กลายเป็นวิดีโอแรกของศิลปินกลุ่มเกาหลีที่มียอดผู้ชมถึงหนึ่งและสองพันล้านครั้งบนยูทูบและยังคงเป็นวิดีโอที่มียอดผู้ชมมากที่สุดของศิลปินกลุ่มเกาหลีจนถึงปัจจุบัน มิวสิกวิดีโอเพลง "คิลดิสเลิฟ" (2019) และ "ฮาวยูไลก์แดต" (2020) เคยถูกบันทึกให้เป็นมิวสิกวิดีโอที่มียอดผู้ชมมากที่สุดใน 24 ชั่วโมงแรกและเพลงหลังถูกบันทึกในบันทึกสถิติโลกกินเนสส์ถึงห้ารายการ</p>
      <p class="card-text"><small class="text-body-secondary">Last updated 3 mins ago</small></p>
    </div>
  </div>
  <div class="card">
    <img src="https://i.pinimg.com/564x/45/3a/8f/453a8f7125f49ad9402f11fffe4efa60.jpg" class="card-img-top" height="260px" alt="...">
    <div class="card-body">
      <h5 class="card-title">Black Pink</h5>
      <p class="card-text">ตลอดอาชีพการงานของวง แบล็กพิงก์ได้ทำลายสถิติมากมาย บอร์นพิงก์เวิลด์ทัวร์ (2022–23) กลายเป็นทัวร์คอนเสิร์ตที่ทำรายได้สูงสุดของศิลปินกลุ่มหญิง และเป็นศิลปินเอเชียรายแรกที่ได้ลงพาดหัวข่าวในเทศกาลโคเชลลา พวกเธอยังเป็นศิลปินที่มียอดผู้ติดตามและยอดผู้ชมสูงสุดบนยูทูบ เช่นเดียวกับเกิร์ลกรุปที่มียอดผู้ติดตามและยอดสตรีมสูงสุดบนสปอติฟาย แบล็กพิงก์ยังได้รับรางวัลมากมาย รวมถึงโกลเดนดิสก์อะวอดส์, บิลบอร์ดมิวสิกอะวอดส์, พีเพิลส์ชอยซ์อะวอดส์ และเอ็มทีวีวิดีโอมิวสิกอะวอดส์ กลายเป็นเกิร์ลกรุปวงแรกในศตวรรษที่ 21 ที่ชนะรางวัลศิลปินกลุ่มแห่งปี พวกเธอยังเป็นเกิร์ลกรุปวงแรกที่ติดอันดับผู้ทรงอิทธิพลเอเชียที่มีอายุไม่เกิน 30 ปี ของฟอบส์ และได้ชื่อว่าผู้ให้ความบันเทิงแห่งปี จากนิตยสาร ไทม์ รวมถึงได้รับการยอมรับให้เป็นหนึ่งในผู้มีชื่อเสื่ยงที่มีอิทธิพลที่สุดในเกาหลีใต้ โดยนิตยสารฟอบส์ เกาหลี (ติดสามอันดับแรกในปี 2019–23) อดีตประธานาธิบดีเกาหลีใต้ มุน แจ-อิน ยังกล่าวถึงวงในฐานะปรากฏการณ์ระดับโลกที่ช่วยเผยแพร่วัฒนธรรมเคป็อปด้วย</p>
      <p class="card-text"><small class="text-body-secondary">Last updated 3 mins ago</small></p>
    </div>
  </div>
</div>
</div>
</template>
